// export const label = ['1930 🇺🇾', '1934 🇮🇹', '1938 🇫🇷', '1950 🇧🇷', '1954 🇨🇭', '1958 🇸🇪', '1962 🇨🇱', '1966 🏴󠁧󠁢󠁥󠁮󠁧󠁿', '1970 🇲🇽', '1974 🇩🇪', '1978 🇦🇷', '1982 🇪🇸', '1986 🇲🇽', '1990 🇮🇹', '1994 🇺🇸', '1998 🇫🇷', '2002 🇯🇵 🇰🇷', '2006 🇩🇪', '2010 🇿🇦', '2014 🇧🇷', '2018 🇷🇺', '2022 🇶🇦'];

export const label: string[] = ['1930 🇺🇾', '1934 🇮🇹', '1938 🇫🇷', '1950 🇧🇷', '1954 🇨🇭', '1958 🇸🇪', '1962 🇨🇱', '1966 🏴󠁧󠁢󠁥󠁮󠁧󠁿', '1970 🇲🇽', '1974 🇩🇪', '1978 🇦🇷', '1982 🇪🇸', '1986 🇲🇽', '1990 🇮🇹', '1994 🇺🇸', '1998 🇫🇷', '2002 🇯🇵 🇰🇷', '2006 🇩🇪', '2010 🇿🇦', '2014 🇧🇷', '2018 🇷🇺'];

export const year: string[] = ['1930', '1934', '1938', '1950', '1954', '1958', '1962', '1966', '1970', '1974', '1978', '1982', '1986', '1990', '1994', '1998', '2002', '2006', '2010', '2014', '2018'];

export const yearY: string[] = ['year1930', 'year1934', 'year1938', 'year1950', 'year1954', 'year1958', 'year1962', 'year1966', 'year1970', 'year1974', 'year1978', 'year1982', 'year1986', 'year1990', 'year1994', 'year1998', 'year2002', 'year2006', 'year2010', 'year2014', 'year2018'];

export const regions: string[] = ['asia', 'africa', 'europe', 'oceania', 'southamerica', 'ncac']

export const countryLabels = {
  Country1: "Country1",
  Country2: "Country2",
  Country3: "Country3",
  Country4: "Country4",
}

export const appTitle: string = "🏆FIFA World Cup Results🏆";
export const svg: string = "/ball.png";

// 国データ取得用URL
export const url = 'http://localhost:3000/api/data';
